var gameUrl = "http://127.0.0.1:3000/";

/**
 * 游戏基本数据
 */

// 战损
let proportion =
[
    [0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
    [0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
    [0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
    [0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
    [0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
    [0,0],[0,0],[0,0],[0,0],[0,0],[0,0],
]

// 手牌
let cardData = {
    heng : [
        {
            name : '范睢',
            txt : '将任意一名名将从地图上移除，放置到在野区域。',
            type : '士',
            img : '',
            index : 0,
            fun : '',
            isRemove : false
        },
        {
            name : '韩非',
            txt : '只能于己方的手牌数量少于或等于对方时明出，抓两张牌。',
            type : '士',
            img : '',
            index : 1,
            fun : '',
            isRemove : false
        },
        {
            name : '张仪',
            txt : '将任意一个接见状态的立场棋左移二格，然后翻到背面。【或】将任意一个不见来使状态的立场棋左移一格',
            type : '士',
            img : '',
            index : 2,
            fun : '',
            isRemove : false
        },
        {
            name : '秦王',
            txt : '从连横方的牌库中找一张牌放置在手上，然后将该牌库洗牌。',
            type : '士',
            img : '',
            index : 3,
            fun : '',
            isRemove : false
        },
        {
            name : '李斯',
            txt : '只能于对方明出人物牌时明出，取消对方的这张人物牌效果。对方行动阶段立即结束。',
            type : '士',
            img : '',
            index : 4,
            fun : '',
            isRemove : false
        },
        {
            name : '紧急动员',
            txt : '对秦国进行一次增援行动，然后指挥秦国进行一次军事行动',
            type : '',
            img : '',
            index : 5,
            fun : '',
            isRemove : false
        },
        {
            name : '紧急动员',
            txt : '对秦国进行一次增援行动，然后指挥秦国进行一次军事行动',
            type : '',
            img : '',
            index : 6,
            fun : '',
            isRemove : false
        },
        {
            name : '紧急动员',
            txt : '对秦国进行一次增援行动，然后指挥秦国进行一次军事行动',
            type : '',
            img : '',
            index : 7,
            fun : '',
            isRemove : false
        },
        {
            name : '紧急动员',
            txt : '对秦国进行一次增援行动，然后指挥秦国进行一次军事行动',
            type : '',
            img : '',
            index : 8,
            fun : '',
            isRemove : false
        },
        {
            name : '举国征招',
            txt : '选择二个秦国控制的地区各放置一个待命状态的秦军，必须优先放置在秦国部队棋较少的地区',
            type : '',
            img : '',
            index : 9,
            fun : '',
            isRemove : false
        },
        {
            name : '举国征招',
            txt : '选择二个秦国控制的地区各放置一个待命状态的秦军，必须优先放置在秦国部队棋较少的地区',
            type : '',
            img : '',
            index : 10,
            fun : '',
            isRemove : false
        },
        {
            name : '名将出山',
            txt : '选择一个在野区域的名将棋，将其以待命状态放置在存在该诸侯部队棋的地区。',
            type : '',
            img : '',
            index : 11,
            fun : '',
            isRemove : false
        },
        {
            name : '兵分两路',
            txt : '指挥秦国连续进行二次军事行动',
            type : '',
            img : '',
            index : 12,
            fun : '',
            isRemove : false
        },
        {
            name : '鼓舞士气',
            txt : '将一个地区的最多4个疲惫状态的秦国部队棋翻回待命状态，然后可以指挥秦国进行一次军事行动。',
            type : '',
            img : '',
            index : 13,
            fun : '',
            isRemove : false
        },
        {
            name : '箭如雨下',
            txt : '指挥秦国进行一次军事行动。本次行动阶段中的战斗规则改为：先掷一个骰判定守方的损失，守方损失的部队棋后再掷一个骰判定攻方的损失',
            type : '',
            img : '',
            index : 14,
            fun : '',
            isRemove : false
        },
        {
            name : '连横·楚',
            txt : '将楚国的接见状态的立场棋左移二格，然后翻到背面。【或】仅当楚国属于连横方时，对楚国进行一次增援行动，然后指挥楚国进行一次军事行动。',
            type : '',
            img : '',
            index : 15,
            fun : '',
            isRemove : false
        },
        {
            name : '连横·赵',
            txt : '将赵国的接见状态的立场棋左移二格，然后翻到背面。【或】仅当赵国属于连横方时，对赵国进行一次增援行动，然后指挥赵国进行一次军事行动。',
            type : '',
            img : '',
            index : 16,
            fun : '',
            isRemove : false
        },
        {
            name : '连横·齐',
            txt : '将齐国的接见状态的立场棋左移二格，然后翻到背面。【或】仅当齐国属于连横方时，对齐国进行一次增援行动，然后指挥齐国进行一次军事行动。',
            type : '',
            img : '',
            index : 17,
            fun : '',
            isRemove : false
        },
        {
            name : '连横·魏韩燕',
            txt : '选择魏、韩、燕国三个诸侯国中的一个，将其接见状态的立场棋左移二格，然后翻到背面。【或】仅当其属于连横方时，对该诸侯国进行一次增援行动，然后指挥该诸侯国进行一次军事行动。',
            type : '',
            img : '',
            index : 18,
            fun : '',
            isRemove : false
        },
        {
            name : '连横·魏韩燕',
            txt : '选择魏、韩、燕国三个诸侯国中的一个，将其接见状态的立场棋左移二格，然后翻到背面。【或】仅当其属于连横方时，对该诸侯国进行一次增援行动，然后指挥该诸侯国进行一次军事行动。',
            type : '',
            img : '',
            index : 19,
            fun : '',
            isRemove : false
        },
    ],
    zong : [
        {
            name : '孟尝君',
            txt : '只能于齐国属于合纵方时明出，从合纵方的牌库中找一张牌放置在手上，然后将该牌库洗牌。',
            type : '士',
            img : '',
            index : 0,
            fun : '',
            isRemove : false
        },
        {
            name : '信陵君',
            txt : '只能于魏国属于合纵方时明出，从合纵方的牌库中找一张牌放置在手上，然后将该牌库洗牌。',
            type : '士',
            img : '',
            index : 1,
            fun : '',
            isRemove : false
        },
        {
            name : '郭隗',
            txt : '只能于燕国属于合纵方且己方的手牌数量少于或等于对方时明出，抓两张牌。',
            type : '士',
            img : '',
            index : 2,
            fun : '',
            isRemove : false
        },
        {
            name : '春申君',
            txt : '只能于楚国属于合纵方且己方的手牌数量少于或等于对方时明出，抓两张牌。',
            type : '士',
            img : '',
            index : 3,
            fun : '',
            isRemove : false
        },
        {
            name : '荆轲',
            txt : '只能于燕国属于合纵方且对方明出人物牌时明出，取消对方的这张人物牌效果，并将该牌跟荆轲一起移出游戏。对方行动阶段立即结束。',
            type : '士',
            img : '',
            index : 4,
            fun : '',
            isRemove : false
        },
        {
            name : '毛遂',
            txt : '将任意一个接见状态的立场棋右移一格，然后指挥任意一个合纵方诸侯进行一次军事行动。',
            type : '士',
            img : '',
            index : 5,
            fun : '',
            isRemove : false
        },
        {
            name : '公孙衍',
            txt : '将任意一个接见状态的立场棋右移二格，然后翻到背面。【或】将任意一个不见来使状态的立场棋右移一格',
            type : '士',
            img : '',
            index : 6,
            fun : '',
            isRemove : false
        },
        {
            name : '苏秦',
            txt : '将任意二个接见状态的立场棋分别右移一格，然后翻到背面。【或】将任意一个不见来使状态的立场棋右移一格',
            type : '士',
            img : '',
            index : 7,
            fun : '',
            isRemove : false
        },
        {
            name : '联合征募',
            txt : '对任意两个诸侯进行一次增援行动',
            type : '',
            img : '',
            index : 8,
            fun : '',
            isRemove : false
        },
        {
            name : '联合征募',
            txt : '对任意两个诸侯进行一次增援行动',
            type : '',
            img : '',
            index : 9,
            fun : '',
            isRemove : false
        },
        {
            name : '名将出山',
            txt : '选择一个在野区域的名将棋，将其以待命状态放置在存在该诸侯部队棋的地区。',
            type : '',
            img : '',
            index : 10,
            fun : '',
            isRemove : false
        },
        {
            name : '名将出山',
            txt : '选择一个在野区域的名将棋，将其以待命状态放置在存在该诸侯部队棋的地区。',
            type : '',
            img : '',
            index : 11,
            fun : '',
            isRemove : false
        },
        {
            name : '名将出山',
            txt : '选择一个在野区域的名将棋，将其以待命状态放置在存在该诸侯部队棋的地区。',
            type : '',
            img : '',
            index : 12,
            fun : '',
            isRemove : false
        },
        {
            name : '鼓舞士气',
            txt : '将一个地区任意一个仇秦或反秦诸侯的最多4个疲惫状态的部队棋翻回待命状态，然后可以指挥该诸侯进行一次军事行动。',
            type : '',
            img : '',
            index : 13,
            fun : '',
            isRemove : false
        },
        {
            name : '箭如雨下',
            txt : '指挥任意一个仇秦或反秦诸侯进行一次军事行动。本次行动阶段中的战斗规则改为：先掷一个骰判定守方的损失，守方损失的部队棋后再掷一个骰判定攻方的损失',
            type : '',
            img : '',
            index : 14,
            fun : '',
            isRemove : false
        },
        {
            name : '连横·楚',
            txt : '将楚国的接见状态的立场棋右移二格，然后翻到背面。【或】仅当楚国属于连横方时，对楚国进行一次增援行动，然后指挥楚国进行一次军事行动。',
            type : '',
            img : '',
            index : 15,
            fun : '',
            isRemove : false
        },
        {
            name : '连横·赵',
            txt : '将赵国的接见状态的立场棋右移二格，然后翻到背面。【或】仅当赵国属于连横方时，对赵国进行一次增援行动，然后指挥赵国进行一次军事行动。',
            type : '',
            img : '',
            index : 16,
            fun : '',
            isRemove : false
        },
        {
            name : '连横·齐',
            txt : '将齐国的接见状态的立场棋右移二格，然后翻到背面。【或】仅当齐国属于连横方时，对齐国进行一次增援行动，然后指挥齐国进行一次军事行动。',
            type : '',
            img : '',
            index : 17,
            fun : '',
            isRemove : false
        },
        {
            name : '连横·魏韩燕',
            txt : '选择魏、韩、燕国三个诸侯国中的一个，将其接见状态的立场棋右移二格，然后翻到背面。【或】仅当其属于连横方时，对该诸侯国进行一次增援行动，然后指挥该诸侯国进行一次军事行动。',
            type : '',
            img : '',
            index : 18,
            fun : '',
            isRemove : false
        },
        {
            name : '连横·魏韩燕',
            txt : '选择魏、韩、燕国三个诸侯国中的一个，将其接见状态的立场棋右移二格，然后翻到背面。【或】仅当其属于连横方时，对该诸侯国进行一次增援行动，然后指挥该诸侯国进行一次军事行动。',
            type : '',
            img : '',
            index : 19,
            fun : '',
            isRemove : false
        },
    ],

}

let heroData = {
    '秦' : ['王翦','白起','司马错'],
    '楚' : ['项燕'],
    '齐' : ['田单'],
    '燕' : ['乐毅'],
    '赵' : ['李牧','廉颇','赵奢']
}
   
console.log(heroData.楚)
/**
 * 游戏进行时的数据
 */

// 在野武将 秦楚齐燕赵魏韩
let heroOut = {
    '秦' : ['王翦','白起','司马错'],
    '楚' : ['项燕'],
    '齐' : ['田单'],
    '燕' : ['乐毅'],
    '赵' : ['李牧','廉颇','赵奢']
}
   


// 游戏回合
let rountGame = 0;

// 当前玩家
let nowPlayer = '合纵'

let CountryPoliceData = [3,6,3,3,3,3]

let sky = ['合纵', true]